{
  "basics": {
    "name": "Jiefeng Zhou",
    "role": "Senior Student",
    "image": "",
    "email": "jiefeng.zhou@hotmail.com",
    "phone": "(+86)-159-2802-0298",
    "url": "https://github.com/JeffeyChou",
    "location": {
      "address": "Chengdu",
      "postalCode": 611731,
      "city": "Chengdu",
      "countryCode": "CN",
      "region": "Sichuan"
    },
    "profiles": [
      {
        "network": "Google Scholar",
        "username": "Jiefeng Zhou",
        "url": "https://scholar.google.com/citations?hl=en&user=91LXriwAAAAJ"
      },
      {
        "network": "ORCID",
        "username": "JeffeyChou",
        "url": "https://orcid.org/0009-0003-0424-2381"
      },
      {
        "network": "GitHub",
        "username": "JeffeyChou",
        "url": "https://github.com/JeffeyChou"
      }
    ]
  },
  "work": [],
  "volunteer": [
    {
      "organization": "Expert Systems with Applications (Journal)",
      "location": "Elsevier",
      "position": "Peer Reviewer",
      "url": "https://www.journals.elsevier.com/expert-systems-with-applications",
      "startDate": "2023-12-01",
      "endDate": "2023-12-31",
      "summary": "Conducted peer review for one publication/grant for Expert Systems with Applications journal.",
      "highlights": [
        "Reviewed manuscript for Expert Systems with Applications journal."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Electronic Science and Technology of China (UESTC, 985 project)",
      "location": "Chengdu, China",
      "url": "https://en.uestc.edu.cn/",
      "area": "Mathematics-Physics Fundamental Science (Elite Program@Yingcai Honors College)",
      "studyType": "B.S. | GPA: 3.87/4.0",
      "startDate": "2021-09-01",
      "endDate": "2025-07-01",
      "score": "3.87/4.00",
      "courses": [
        "Mathematics: Calculus, Algebra and Geometry, Numerical Analysis, Time Series Analysis, Stochastic Processes, Probability and Statistics",
        "Physics: University Physics, Physical Experiment, Theoretical Mechanics, Quantum Mechanics",
        "Computer Science: Data Structure and Algorithm, Machine Learning, Deep Learning, Reinforcement Learning"
      ]
    }
  ],
  "awards": [
    {
      "title": "National Grants * 3",
      "date": "2024, 2023, 2022",
      "awarder": "Sichuan Provincial Department of Education (National Level, Top 20%)",
      "url": null,
      "summary": null
    },
    {
      "title": "Dream Scholarship",
      "date": "2024-11-01",
      "awarder": "China Education Development Foundation (National Level, Top 20%)",
      "url": null,
      "summary": null
    },
    {
      "title": "Model Student Scholarship * 2",
      "date": "2023, 2022",
      "awarder": "UESTC (University Level, Top 30%)",
      "url": null,
      "summary": null
    },
    {
      "title": "Top 7% | The 17th IEEExtreme Programming Competition",
      "date": "2023-12-01",
      "awarder": "IEEExtreme Programming Competition (Global Level)",
      "url": null,
      "summary": null
    },
    {
      "title": "First Prize | The 23rd Mathematical Modeling Competition of UESTC",
      "date": "2023-05-01",
      "awarder": "UESTC (University Level, TOP 5%)",
      "url": null,
      "summary": null
    },
    {
      "title": "First Prize | Sichuan College Students' Information Literacy Competition ",
      "date": "2023-04-01",
      "awarder": "Sichuan Provincial Department of Education (Provincial level, TOP 1%)",
      "url": null,
      "summary": null
    }
  ],
  "certificates": [],
  "publications": [
    {
      "name": "Random Walk in Random Permutation Set Theory",
      "publisher": "Chaos: An Interdisciplinary Journal of Nonlinear Science",
      "releaseDate": "2024",
      "url": "https://doi.org/10.1063/5.0220154",
      "summary": "<u>Jiefeng Zhou</u>, Zhen Li and Yong Deng"
    },
    {
      "name": "Generalized Information Entropy and Generalized Information Dimension",
      "publisher": "Chaos, Solitons & Fractals (IF5.3, JCR Q1)",
      "releaseDate": "2024",
      "url": "https://doi.org/10.1016/j.chaos.2024.114976",
      "summary": "Tianxiang Zhan, <u>Jiefeng Zhou</u>, Zhen Li, and Yong Deng"
    },
    {
      "name": "An Improved Information Volume of Mass Function Based on Plausibility Transformation Method",
      "publisher": "Expert Systems with Applications (IF7.5, JCR Q1)",
      "releaseDate": "2024",
      "url": "https://doi.org/10.1016/j.eswa.2023.121663",
      "summary": "<u>Jiefeng Zhou</u>, Zhen Li, and Yong Deng"
    },
    {
      "name": "Limit of the Maximum Random Permutation Set Entropy",
      "publisher": "Physica A (IF 2.8, JCR Q2)",
      "releaseDate": "Under review",
      "url": "https://arxiv.org/abs/2403.06206",
      "summary": "<u>Jiefeng Zhou</u>, Zhen Li, Kang Hao Cheong, and Yong Deng"
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "level": "Advanced",
      "keywords": ["Python (3+ yrs)", "C (3+ yrs)", "MATLAB (2+ yrs)"]
    },
    {
      "name": "Software & Tools",
      "level": "Proficient",
      "keywords": ["Unix (1+ yr)", "Git (2+ yr)", "MS Office (4+ yrs)", "PyTorch (2+ yrs)", "TensorFlow (1+ yr)", "LaTeX (2+ yrs)"]
    },
    {
      "name": "Languages",
      "level": "Native/Proficient",
      "keywords": ["Mandarin (native)", "Cantonese (proficient)", "English (proficient, TOEFL Score: 102)"]
    }
  ],
  "languages": [],
  "interests": [],
  "references": [],
  "projects": [
    {
      "name": "Natural Language Processing: Development of Large-Scale Language Model Datasets (RA at UCR)",
      "summary": "Developed a benchmark for Large Language Models (LLMs) to test their reasoning capabilities and instruction-following ability under conflict information. Proposed information hierarchy within instructions, verified by ablation study. Designed scoring prompts and collected responses from different LLM models, conducting empirical study on the results.",
      "highlights": [
        "Developed a benchmark for Large Language Models (LLMs) to test their reasoning capabilities and instruction-following ability under conflict information.",
        "Proposed information hierarchy within instructions. Our ablation study verified its effectiveness.",
        "Designed scoring prompts and collected responses from different LLM models, conducted an empirical study on the results."
      ],
      "startDate": "2024-07-01",
      "endDate": "Present",
      "url": null,
      "keywords": ["NLP", "LLM", "Benchmark", "Information Hierarchy"]
    },
    {
      "name": "Random Walk in Random Permutation Set Theory (Lead)",
      "summary": "Established a link between Random Permutation Set Theory (RPST) and random walks, enhancing understanding in both fields. Developed a random walk model derived from RPST, showing similarities to Gaussian random walks. Demonstrated that this random walk can be transformed into a Wiener process through a specific scaling procedure.",
      "highlights": [
        "Established a link between Random Permutation Set Theory (RPST) and random walks, enhancing understanding in both fields.",
        "Developed a random walk model derived from RPST, showing similarities to Gaussian random walks.",
        "Demonstrated that this random walk can be transformed into a Wiener process through a specific scaling procedure."
      ],
      "startDate": "2024-03-01",
      "endDate": "2024-05-01",
      "url": null,
      "keywords": ["RPST", "Random Walk", "Wiener Process"]
    },
    {
      "name": "Generalized Information Entropy and Generalized Information Dimension (Core member)",
      "summary": "Proposed a Generalized Information Entropy (GIE) to unify various forms of entropy and established the relationship between entropy, fractal dimension, and number of events. Developed a Generalized Information Dimension (GID) to extend the definition of information dimension from probability to mass fusion. Analyzed the role of GIE in approximation calculation and coding systems, demonstrating the particle nature of information similar to Boltzmann entropy.",
      "highlights": [
        "Proposed a Generalized Information Entropy (GIE) to unify various forms of entropy and established the relationship between entropy, fractal dimension, and number of events.",
        "Developed a Generalized Information Dimension (GID) to extend the definition of information dimension from probability to mass fusion.",
        "Analyzed the role of GIE in approximation calculation and coding systems, demonstrating the particle nature of information similar to Boltzmann entropy."
      ],
      "startDate": "2024-01-01",
      "endDate": "2024-03-01",
      "url": null,
      "keywords": ["Generalized Information Entropy", "Generalized Information Dimension", "Fractal Dimension"]
    },
    {
      "name": "Limit of the Maximum Random Permutation Set Entropy (Lead)",
      "summary": "Proposed the Random Permutation Set (RPS) as a generalization of evidence theory and defined the concept of the envelope of entropy function. Derived and proved the limit of the envelope of RPS entropy, demonstrating significant reduction in computational complexity. Validated the efficiency and conciseness of the proposed envelope through numerical examples, providing new insights into the maximum entropy function.",
      "highlights": [
        "Proposed the Random Permutation Set (RPS) as a generalization of evidence theory and defined the concept of the envelope of entropy function.",
        "Derived and proved the limit of the envelope of RPS entropy, demonstrating significant reduction in computational complexity.",
        "Validated the efficiency and conciseness of the proposed envelope through numerical examples, providing new insights into the maximum entropy function."
      ],
      "startDate": "2023-10-01",
      "endDate": "2024-01-01",
      "url": null,
      "keywords": ["Random Permutation Set", "Entropy Envelope", "Evidence Theory"]
    },
    {
      "name": "An Improved Information Volume of Mass Function (Lead)",
      "summary": "Proposed an improved Information Volume of Mass Function (IVMF) based on the Plausibility Transformation Method (PTM) to address issues with inconsistent frames of discernment (FOD). Developed a method that yields more reasonable results compared to existing methods in cases of inconsistent FOD, by treating IVMF as a geometric mean of first-order and higher-order information volumes. Demonstrated the efficacy and rationality of the proposed IVMF through a series of numerical examples and an application in threat assessment.",
      "highlights": [
        "Proposed an improved Information Volume of Mass Function (IVMF) based on the Plausibility Transformation Method (PTM) to address issues with inconsistent frames of discernment (FOD).",
        "Developed a method that yields more reasonable results compared to existing methods in cases of inconsistent FOD, by treating IVMF as a geometric mean of first-order and higher-order information volumes.",
        "Demonstrated the efficacy and rationality of the proposed IVMF through a series of numerical examples and an application in threat assessment."
      ],
      "startDate": "2022-12-01",
      "endDate": "2023-05-01",
      "url": null,
      "keywords": ["Information Volume of Mass Function", "Plausibility Transformation Method", "Frame of Discernment"]
    },
    {
      "name": "Bayesian Deep Q-Networks for Suika Game",
      "summary": "Modeled an MDP problem from open-source game code, extracted relevant game data, and studied Bayesian Deep Q-learning algorithms by reviewing related papers and code. Implemented and enhanced Bayesian Q-learning algorithms within the game environment, integrating Thompson sampling to account for better probability estimation.",
      "highlights": [
        "Modeled an MDP problem from open-source game code, extracted relevant game data, and studied Bayesian Deep Q-learning algorithms by reviewing related papers and code.",
        "Implemented and enhanced Bayesian Q-learning algorithms within the game environment, integrating Thompson sampling to account for better probability estimation."
      ],
      "startDate": "2024-04-01",
      "endDate": "2024-05-01",
      "url": null,
      "keywords": ["Bayesian Deep Q-Networks", "Reinforcement Learning", "Thompson Sampling", "MDP"]
    },
    {
      "name": "Pneumonia Detection Breast Cancer Segmentation With Att-UNet",
      "summary": "Implemented the UNet and Attention-UNet using PyTorch, based on thorough research into CNN and UNet principles, achieving over 95% accuracy on the validation set, successfully deploying image segmentation algorithms on original image classification task. Enhanced the training dataset through data augmentation to improve training effectiveness, ensuring better performance with limited initial data. Collected and visualized training logs.",
      "highlights": [
        "Implemented the UNet and Attention-UNet using PyTorch, based on thorough research into CNN and UNet principles, achieving over 95% accuracy on the validation set, successfully deploying image segmentation algorithms on original image classification task.",
        "Enhanced the training dataset through data augmentation to improve training effectiveness, ensuring better performance with limited initial data.",
        "Collected and visualized training logs."
      ],
      "startDate": "2023-07-01",
      "endDate": "2023-07-01",
      "url": null,
      "keywords": ["UNet", "Attention-UNet", "Image Segmentation", "PyTorch", "CNN"]
    },
    {
      "name": "Implementation of a Text Generation Model Based on TRANSFORMER structure",
      "summary": "Implemented a decoder-only transformer-based text generation model (GPT-2) with self-attention mechanisms to capture data patterns and dependencies. Analyzed model performance through detailed experimental results, discussing strengths in generating coherent text and identifying areas for enhancement in text generation tasks.",
      "highlights": [
        "Implemented a decoder-only transformer-based text generation model (GPT-2) with self-attention mechanisms to capture data patterns and dependencies.",
        "Analyzed model performance through detailed experimental results, discussing strengths in generating coherent text and identifying areas for enhancement in text generation tasks."
      ],
      "startDate": "2024-04-01",
      "endDate": "2024-05-01",
      "url": null,
      "keywords": ["Transformer", "GPT-2", "Text Generation", "Self-Attention"]
    }
  ]
}